
// 投资方向改由后台输出,此枚举停止使用
export const invtDirDict = {
  '1': '基金',
  '2': '债券',
  '3': '股票',
  '4': '期权',
  '5': '票据',
  '12': '外汇即期',
  '15': '贵金属-黄金',
  '20': '回购',
  '21': '同业存放/拆借',
  '22': '存放同业/拆放',
  '23': '信贷资产',
  '24': '信托计划',
  '25': '银行存款',
  '27': '资产包',
  '29': '新股申购',
  '31': '利率远期',
  '32': '利率掉期',
  '33': '外汇远期',
  '34': '货币掉期',
  '35': '挂钩结构性产品',
  '36': '信用违约掉期',
  '37': '其它',
  '38': '配股权证'
};

export const docNameDict = {
  '01': '产品合同',
  '02': '认购风险申请书',
  '03': '认购风险申请书之补充协议',
  '04': '信托计划说明书',
  '05': '产品发行公告',
  '06': '电子签名约定书',
  '07': '推介视频',
  '99': '其他'
};
