/**
 * 生产模式的配置项
 * 可用process.env访问各项配置
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!此配置为生产环境配置，请慎重改动
 */
module.exports = {
  config: {
    // virtualHost: "https://mpaas-mcube-mcube-lb-0.ghbankmpaas.com",
    virtualHost: "https://mpaas.ghbank.com.cn/mcube",
    workspace: "161BC41101438_product",
    ASSETS_URL: "https://perbank.ghbank.com.cn/perbank/static/images/integration/h5_product"
  },
  envConfig: {
    NODE_ENV: '"production"',
    MGS_WORK_SPACE: '"prod"',
    RPC_PATH: '"com.nmb."', //RPC请求路劲
  }
};
