
  /**
   * @desc 用于转换后台返回代码，结合ditionary使用
   * @param {String} name 需要转换对象的名称
   * @param {String} key 后台返回的key
   * @example trans('depositTerm', key)或$tools.trans('depositTerm', key)
   */
export function trans(name, key) {
  return dictionary[name][key] ? dictionary[name][key] : key;
};

const dictionary = {
  // 交易记录状态
  TXNSTATUS: {
    "T": "已回退",
  	"0": "预受理",
  	"1": "受理",
    "2": "已撤单",
  	"3": "已抹账",
  	"4": "失败",
    "5": "确认中",
  	"6": "部分确认未全部返回",
  	"7": "部分确认已全部返回",
  	"8": "确认成功",
  	"9": "确认失败",
  	"A": "认购确认",
  	"B": "份额调账",
  	"C": "待撤",
    "D": "分红数据",
  	"E": "预约中",
  	"F": "批处理失败",
  	"G": "受理中",
  	"S": "成功",
    "Z": "处理中",
  	"P": "待审批",
  	"W": "已审批，待确认",
  	"O": "发送基金公司超时",
  },
  // 银行卡类型
  CARDTYPE: {
    A001: "借记卡",
    A002: "定期一本通",
    A003: "活期一本通",
    A004: "企业活期户",
    A005: "企业定期户",
    A006: "企业通知户",
    A007: "内部账户",
    A008: "贷款户",
    A009: "其他",
    A010: "保证金",
    A011: "定期同业存款",
    A012: "个人存单",
    A013: "个人存折",
    A014: "个人支票",
    A015: "验资户",
    A016: "电子零钱包",
    A017: "华兴天猫钱袋",
    A018: "移动手机钱包",
    A019: "移动手机钱包"
  },
  // 币种符号
  CURRENCY_ICON: {
    "01": "¥",
    "13": "HK$",
    "14": "$",
    "12": "£",
    "15": "Fr",
    "18": "S$",
    "27": "JPY¥",
    "28": "C$",
    "29": "A$",
    "38": "€",
    "43": "₩",
    "90": "₱",
  },
  // 币种
  CRCYCD: {
    "01": "人民币",
    "13": "港币",
    "14": "美元",
    "12": "英镑",
    "15": "瑞士法郎",
    "18": "新加坡元",
    "27": "日元",
    "28": "加元",
    "29": "澳元",
    "38": "欧元",
    "43": "韩元",
    "90": "卢布",
  },
  // 币种2
  CRCYCD2: {
    "人民币": "01",
    "港币": "13",
    "美元": "14",
    "英镑": "12",
    "瑞士法郎": "15",
    "新加坡元": "18",
    "日元": "27",
    "加元": "28",
    "澳元": "29",
    "欧元": "38",
    "韩元": "43",
    "卢布": "90",
  },
  // 币种3
  CRCYCD3: {
    "156":"人民币",
    "344":"港元",
    "392":"日元",
    "826":"英镑",
    "840":"美元",
    "910":"欧元",
    "036":"澳元",
    "124":"加元",
    "702":"新加坡元",
    "410":"韩元",
  },
  // 存期
  // 存期 000-活期，101一天 107七天 201一个月 203三个月 206六个月 301一年 302二年 303三年 305五年 306六年 308八年 999约定存期 OTH不约定存期
  TERMCD: {
    '000': '活期',
    '101': '一天',
    '107': '七天',
    '201': '一个月',
    '203': '三个月',
    '206': '六个月',
    '301': '一年',
    '302': '二年',
    '303': '三年',
    '305': '五年',
    '306': '六年',
    '308': '八年',
    '999': '约定存期',
    'OTH': '不约定存期'
  },
  // 操作记录
  HANDLE_REPORT: {
    MB01: '登录',
    MB02: '注册',
    MB03: '找回密码',
    MB04: '账户管理',
    MB05: '转账汇款',
    MB06: '他行卡转入',
    MB07: '理财',
    MB08: '智能存款',
    MB09: '个人信息设置',
    MB10: '登录设置',
    MB11: '短信通知设置',
    MB12: '常用设备管理',
    MB13: '交易密码修改',
    MB14: '小额免密免签设置',
    MB15: '限额管理',
    MB16: '安全工具设置',
    MB17: '交易保镖设置',
    MB18: '挂失',
    MB19: '风险评估',
    MB20: '退出',
    MB21: '个人结售汇',
    MB23: '七兴宝',
    MB22: '基金',
    MB24: '二三类户充值提现'
  },
  // 操作记录代码
  REVERSE_HANDLE: {
    all: '',   //全部
    login: 'MB01',  //登录
    register: 'MB02', //注册
    find: 'MB03',  //找回密码
    manage: 'MB04',   //账户管理
    transfer: 'MB05',  //转账汇款
    otherCard: 'MB06',  //他行卡
    money: 'MB07',  //理财 待定
    saveMoney: 'MB08',  //智能存款 待定
    userSet: 'MB09',  //个人信息设置
    foreignBuySale: 'MB21', //个人结售汇
    loginSet: 'MB10',  //登录设置
    messageSet: 'MB11',   //短信通知设置
    commonuse: 'MB12',  //常用设备设置
    changePwd: 'MB13',  //修改密码
    noPwd: 'MB14',   //小额免密
    limit: 'MB15',  //限额管理
    safeSet: 'MB16',      //安全工具设置
    transferSet: 'MB17',  //交易保镖设置
    hangup: 'MB18',   //挂失
    risk: 'MB19',   //风险评估
    exit: 'MB20',  //退出
    sevenBaby: 'MB23', //七兴宝
    fund: 'MB22',  //基金
    EECW: 'MB24' //二三类户
  },
  //IOS U盾错误码转译
  IOS_UKEY_ERRORCODE: {
    "-1": "请确保U盾插在手机上并在交易过程中不要拔出。",
    '0': "操作成功",
    '1': "请确保U盾插在手机上并在交易过程中不要拔出。",
    '2': "您已连续6次输错U盾密码，U盾已被锁定，请前往我行网点柜台进行解锁。",
    '3': "请输入正确的U盾密码。",
    '4': "操作超时。",
    '5': "参数无效",
    '6': "未知错误",
    '7': "交易中断，请重新操作。",
    '8': "请进入您手机“设置”中找到声音设置，打开录音权限或将音量最大化等，然后再试。如无法解决请联系我行客服电话4008308001。",
    '9': "缺失证书，请前往我行网点柜台下载U盾证书。",
    '10': "电量不足，请您将U盾充足电后使用。",
    '11': "请关掉手机上其他正在使用的音频后再插上U盾使用。",
    '12': "交易中断，请重新操作。",
    '13': "U盾需要访问您的麦克风，请打开麦克风访问权限。",
    '14': "密码长度应在A-B位，请确保密码长度符合要求。（请补充位数长度）",
    '15': "请正确操作U盾。",
    '240': "您已连续N次输错U盾密码，再连续输错5-N次，您的U盾将被锁定。",
    '16': "您的U盾初始密码还未修改，为了您的资金安全，请及时修改。",
    '17': "您的U盾证书已过期，请前往我行网点或登录个人网上银行进行证书更新。",
    '18': "证书未生效",
    '19': "您的U盾证书无效，请前往我行网点柜台更新U盾证书。",
    '20': "您的U盾设备类型不匹配，请前往我行网点柜台重新办理。",
    '21': "未匹配到U盾证书，请前往我行网点柜台更新U盾证书。",
    '22': "此应用没有得到蓝牙设置的授权。",
    '23': "连接失败，请打开您的手机蓝牙功能。",
    '24': "连接失败，您的手机不支持蓝牙4.0协议。",
    '25': "连接失败，您的手机已取消连接。",
    '26': "签名报文格式不正确。",
    '27': "签名算法错误。",
    '28': "连接失败，请打开您的手机位置服务。",
    '29': "操作超时，请重新操作。"
  },
  //Android U盾错误码转译
  Android_UKEY_ERRORCODE: {
    "-1": "请确保U盾插在手机上并在交易过程中不要拔出。",
    '0': "操作成功",
    '1': "请确保U盾插在手机上并在交易过程中不要拔出。",
    '2': "您已连续6次输错U盾密码，U盾已被锁定，请前往我行网点柜台进行解锁。",
    '3': "请输入正确的U盾密码。",
    '4': "操作超时。",
    '5': "参数无效。",
    '6': "未知错误。",
    '7': "交易中断，请重新操作。",
    '8': "请进入您手机“设置”中找到声音设置，打开录音权限或将音量最大化等，然后再试。如无法解决请联系我行客服电话4008308001。",
    '9': "缺失证书，请前往我行网点柜台下载U盾证书。",
    '10': "电量不足，请您将U盾充足电后使用。",
    '11': "请关掉手机上其他正在使用的音频后再插上U盾使用。",
    '12': "交易中断，请重新操作。",
    '13': "U盾需要访问您的麦克风，请打开麦克风访问权限。",
    '14': "密码长度应在A-B位，请确保密码长度符合要求。（请补充位数长度）",
    '15': "请正确操作U盾。",
    '16': "您的U盾初始密码还未修改，为了您的资金安全，请及时修改。",
    '17': "您的U盾证书已过期，请前往我行网点或登录个人网上银行进行证书更新。",
    '18': "证书未生效",
    '19': "您的U盾证书无效，请前往我行网点柜台更新U盾证书。",
    '20': "未匹配到U盾证书，请前往我行网点柜台更新U盾证书。",
    '21': "连接失败，请打开您的手机蓝牙功能。",
    '22': "连接失败，您的手机不支持蓝牙4.0协议。",
    '24': "连接失败，您的手机已取消连接。",
    '25': "连接成功。",
    '26': "连接失败，蓝牙已断开。",
    '27': "应用没有申请位置权限。",
    '28': "连接失败，请打开您的手机位置服务。",
    '29': "操作超时，请重新操作。",
  },
  //银行LOG
  BANK_LOG: {
    "306581000003": 'gf', //广发
    "307584007998": 'pingan', //平安
    "303100000006": 'gd', //光大
    "301290000007": 'jt', //交通
    "308584000013": 'zs', //招商
    "313100000013": 'bj', //北京
    "318110000014": 'bohai', //渤海
    "502290000006": 'dy', //东亚
    "102100099996": 'gs', //工商
    "315456000105": 'hengfeng', //恒丰
    "501290000012": 'huifeng', //汇丰
    "304100040000": 'hx', //华夏
    "316331000018": 'zs', //浙商
    "105100000017": 'js', //建设
    "305100000013": 'msyh', //民生
    "103100000026": 'nyyh', //农业
    "325290000012": 'shyh', //上海
    "309391000011": 'xy', //兴业
    "403100000004": 'yzcx', //邮政储蓄
    "104100000004": 'zgyh', //中国
    "302100011000": 'zx', //中信
    "671290000017": 'zhada', //渣打
    "313221030008": 'sj', //盛京
    "310290000013": 'pf', //浦东发展
    "313586000006": 'ghb', //华兴
  },
  //云盾错误码转译
  YUN_ERRORCODE: {
    "1": "内部参数错误",
    "2": "无效的响应数据",
    "3": "未进行身份认证",
    "4": "身份认证session过期",
    "5": "服务器随机数签名失败",
    "6": "已下载证书，不能重复下载",
    "7": "服务器签名验证失败",
    "8": "身份认证未完成",
    "9": "签名报文格式无效",
    "A": "云证痛生产域名无法访问",
    "B": "证书已过期需要重新下载",
    "C": "密码输入错误",
    "D": "密码锁死",
    "E": "需要使用密码",
    "F": "用户输入参数错误",
    "-1": "通用错误"
  }
}
